// Если вы испытываете проблемы с производительностью в React-приложении, убедитесь в том, что вы проводите тесты с настройками минифицированной продакшен-сборки.

// По умолчанию в React есть много вспомогательных предупреждений, очень полезных при разработке
// Тем не менее, они делают React больше и медленнее, поэтому вам обязательно следует использовать продакшен-версию при деплое приложения.

// есть готовые версии для продакшена в виде отдельных файлов
// должно быть .min.js

// список полезных пакетов:

// Brunch - для создания более эффективной сборки
// Browserify - для использования моддульной системы commonJS
// Rollup - позволяет использовать модульную систему ES6 и Tree-shaking для организации и сборки JavaScript-кода.
// webpack - Webpack 4.0 и выше по умолчанию минифицирует код в продакшен-режиме.

// Анализ производительности компонентов с помощью инструмента разработки «Profiler»
